heatTransfer/chtMultiRegionFoam/reverseBurner/system/gas/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue N2 0.79
    volScalarFieldValue O2 0.21
    volScalarFieldValue CH4 0
);

regions
(
    boxToCell
    {
        box     (0 0 -0.01) (0.01 0.1 0.01);
        fieldValues
        (
            volScalarFieldValue N2 0
            volScalarFieldValue O2 0
            volScalarFieldValue CH4 1
        );
    }
);


// ************************************************************************* //
